src/cf/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>БланкПодвал</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкШапка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизацииДиаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФонПечатныхФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСклад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonForms/ФормаПервогоЗапуска/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Заголовок = Нстр("en = 'First launch: initializing the system'; es = 'Primer Inicio: inicialización del sistema'; fr = 'Première exécution: initialisation du système'; ru = 'Первый запуск: инициализация системы'");
    ЭтаФорма.НадписьКомпании = Нстр("en = 'Fill in the company details'; es = 'Rellene los datos de la empresa'; fr = 'Remplissez les détails de l''entreprise'; ru = 'Заполните данные компании'");
    ЭтаФорма.ФормаОткрыта = Истина; 
	//элементы.ПользовательЛПК.Заголовок = Нстр("en = 'Client'; es = 'Cliente'; fr = 'Utilisateur'; ru = 'Пользователь'");
	элементы.НаименованиеКомпании.Заголовок = Нстр("en = 'Name'; es = 'Denominación'; fr = 'Nom'; ru = 'Наименование'");
	элементы.НаименованиеКомпании.Подсказка = Нстр("en = 'Company name'; es = 'Nombre de la empresa'; fr = 'Nom de la société'; ru = 'Наименование компании'");

	элементы.ВидКомпании.Заголовок = Нстр("en = 'View'; es = 'Vista'; fr = 'Vue'; ru = 'Вид'");
	элементы.ВидКомпании.Подсказка = Нстр("en = 'Choose the type of company'; es = 'Seleccione el tipo de empresa'; fr = 'Sélectionnez le type d''entreprise'; ru = 'Выберите вид компании'");
	
	элементы.Префикс.Заголовок = Нстр("en = 'The prefix'; es = 'Prefijo'; fr = 'Préfixe'; ru = 'Префикс'");
	элементы.Префикс.Подсказка = Нстр("en = 'Enter the accounting prefix'; es = 'Introduzca el prefijo de contabilidad'; fr = 'Entrez le préfixe de comptabilité'; ru = 'Введите префикс учёта'");
	
	элементы.Группа6.Заголовок = Нстр("en = 'Logo'; es = 'Logotipo'; fr = 'Logo'; ru = 'Логотип'");
	элементы.Группа7.Заголовок = Нстр("en = 'Background'; es = 'Fondo'; fr = 'Toile de fond'; ru = 'Фон'");
	
	элементы.Логотип.ТекстНевыбраннойКартинки = Нстр("en = 'Click to select an image'; es = 'Haga clic para seleccionar la imagen'; fr = 'Cliquez pour sélectionner une image'; ru = 'Нажмите для выбора изображения'");
	элементы.ФонПечатныхФорм.ТекстНевыбраннойКартинки = Нстр("en = 'Click to select an image'; es = 'Haga clic para seleccionar la imagen'; fr = 'Cliquez pour sélectionner une image'; ru = 'Нажмите для выбора изображения'");  
	
	ЭтаФорма.НадписьПользователя = Нстр("en = 'Fill in the user'; es = 'Completar usuario'; fr = 'Remplissez l''utilisateur'; ru = 'Заполните пользователя'");

	элементы.Логин.Заголовок = Нстр("en = 'Login'; es = 'Inicio de sesión'; fr = 'Login'; ru = 'Логин'");
	элементы.Логин.Подсказка = Нстр("en = 'Enter the user''s username'; es = 'Introduzca su nombre de usuario'; fr = 'Entrez le nom d''utilisateur'; ru = 'Введите логин пользователя'");

	элементы.Пароль.Заголовок = Нстр("en = 'Password'; es = 'Contraseña'; fr = 'Mot de passe'; ru = 'Пароль'");
	элементы.Пароль.Подсказка = Нстр("en = 'Enter the user''s password'; es = 'Introduzca la contraseña de usuario'; fr = 'Entrez le mot de passe de l''utilisateur'; ru = 'Введите пароль пользователя'");

	элементы.ФИО.Заголовок = Нстр("en = 'Full name'; es = 'Nombre completo'; fr = 'Grand nom'; ru = 'ФИО'");
	элементы.ФИО.Подсказка = Нстр("en = 'Enter the user''s full name'; es = 'Introduzca su nombre de usuario completo'; fr = 'Entrez le nom d''utilisateur complet'; ru = 'Введите полное имя пользователя'");

	элементы.Язык.Заголовок = Нстр("en = 'Language'; es = 'Idioma'; fr = 'Langue'; ru = 'Язык'");
	элементы.Язык.Подсказка = Нстр("en = 'Select the system interface language'; es = 'Seleccione el idioma de la interfaz del sistema'; fr = 'Sélectionnez la langue de l''interface système'; ru = 'Выберите язык интерфейса системы'");
	
	Для Каждого Стр Из Метаданные.Роли Цикл
		НС = СЗРоли.Добавить();
		НС.Значение = Стр.Имя;
		НС.Представление = Стр.Синоним; 
		Если Стр.Имя = "Администратор" тогда
			НС.Пометка = Истина;	
		КонецЕсли;
	КонецЦикла;    
	
	Для Каждого Стр Из Метаданные.Языки Цикл
		Элементы.Язык.СписокВыбора.Добавить(Стр.Имя);	
	КонецЦикла;  
	
	Для Каждого Стр Из Элементы.Язык.СписокВыбора Цикл
		
		Если Стр.Значение = "Русский" Тогда
			Стр.Представление = Нстр("en = 'Russian'; es = 'Rusa'; fr = 'Russe'; ru = 'Русский'");
		КонецЕсли; 
		Если Стр.Значение = "Французский" Тогда
			Стр.Представление = Нстр("en = 'Французский'; es = 'Francesa'; fr = 'Français'; ru = 'Французский'");
		КонецЕсли; 
		Если Стр.Значение = "Английский" Тогда
			Стр.Представление = Нстр("en = 'English'; es = 'Inglés'; fr = 'Anglais'; ru = 'Английский'");
		КонецЕсли; 
		Если Стр.Значение = "Испанский" Тогда
			Стр.Представление = Нстр("en = 'Spanish'; es = 'Español'; fr = 'Espagnol'; ru = 'Испанский'");
		КонецЕсли; 
		
	КонецЦикла; 
	
	ЭтаФорма.НадписьСтарт = Нстр("en = 'Welcome!'; es = '¡Bienvenido!'; fr = 'Bienvenue !'; ru = 'Добро пожаловать!'");
	
	КомандаДалее = Команды.Найти("КомандаДалее"); 
    КомандаДалее.Заголовок  = Нстр("fr = 'Ensuite'; ru = 'Далее'; en = 'Further'; es = 'A continuación'"); 
	
	КомандаНазад = Команды.Найти("КомандаНазад"); 
    КомандаНазад.Заголовок  = Нстр("fr = 'En arrière'; ru = 'Назад'; en = 'Back'; es = 'Atrás'"); 
	
	КомандаСтарт = Команды.Найти("КомандаСтарт"); 
    КомандаСтарт.Заголовок  = Нстр("fr = 'Lancement'; ru = 'Старт'; en = 'Start'; es = 'Comienzo'"); 

	КомандаДобавитьПользователя = Команды.Найти("КомандаДобавитьПользователя"); 
    КомандаДобавитьПользователя.Заголовок  = Нстр("fr = 'Ajouter un utilisateur'; ru = 'Добавить пользователя'; en = 'Add a user'; es = 'Añadir usuario'"); 
	
КонецПроцедуры                                     

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ШагФормы = 1;
	ПриИзмененииШагаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)  
	
	Если ФормаОткрыта = Истина тогда  
		ЗавершитьРаботуСистемы(ложь);
	КонецЕсли;	 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриИзмененииШагаФормы()  

	Если ШагФормы = 1 Тогда

		Элементы.КомандаНазад.Видимость = ложь; 
		Элементы.КомандаДалее.Видимость = Истина; 
		Элементы.Группа1.Видимость = Истина;
		Элементы.Группа2.Видимость = ложь;
		Элементы.Группа3.Видимость = ложь;
		
	КонецЕсли;
 
	Если ШагФормы = 2 Тогда

		Элементы.КомандаНазад.Видимость = Истина;  
		Элементы.КомандаДалее.Видимость = Истина; 
		Элементы.Группа1.Видимость = ложь;
		Элементы.Группа2.Видимость = Истина;
		Элементы.Группа3.Видимость = ложь;
		
	КонецЕсли;  
	
	Если ШагФормы = 3 Тогда

		Элементы.КомандаНазад.Видимость = Истина;  
		Элементы.КомандаДалее.Видимость = ложь; 
		Элементы.Группа1.Видимость = ложь;
		Элементы.Группа2.Видимость = ложь;
		Элементы.Группа3.Видимость = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛоготипНажатие(Элемент, СтандартнаяОбработка)
	ВыбратьИзображение(ЭтаФорма, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФонПечатныхФормНажатие(Элемент, СтандартнаяОбработка)
	ВыбратьИзображение(ЭтаФорма, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзображение(Форма, ИмяРеквизита, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ДополнительныеПараметры = Новый Структура("Форма, ИмяРеквизита", Форма, ИмяРеквизита);
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Заголовок = "Выберите изображение";
	ДВФ.МножественныйВыбор = Ложь;
	ДВФ.ПредварительныйПросмотр = Истина;
    ДВФ.ПолноеИмяФайла = "";
	ДВФ.Фильтр = "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.png)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.png|" 
				+ "BMP (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
				+ "JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
				+ "TIFF (*.tif)|*.tif|"
				+ "PNG (*.png)|*.png|";
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораИзображения", ЭтаФорма, ДополнительныеПараметры);
	ДВФ.Показать(Оп);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзображение(Форма, Реквизит) 
	Реквизит = "";
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораИзображения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат КонецЕсли;
	Оп = Новый ОписаниеОповещения("ЗагрузитьИзображение", ЭтаФорма, ДополнительныеПараметры);
	НачатьПомещениеФайлаНаСервер(Оп,,,, ВыбранныеФайлы[0], ДополнительныеПараметры.Форма.УникальныйИдентификатор);
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьИзображение(ОписаниеПомещенногоФайла, ДополнительныеПараметры)  Экспорт
	Если ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда Возврат КонецЕсли;
	Форма = ДополнительныеПараметры.Форма;	
	Форма[ДополнительныеПараметры.ИмяРеквизита] = ОписаниеПомещенногоФайла.Адрес;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)        
	
	Если ПолучитьВозможностьПерехода() тогда
		ШагФормы = ШагФормы + 1;
		ПриИзмененииШагаФормы();                
	КонецЕсли;      

КонецПроцедуры  

&НаКлиенте
Функция ПолучитьВозможностьПерехода()

	ВозвращаемоеЗначение = Истина;
	
	Если ШагФормы = 1 Тогда
		Если НаименованиеКомпании = "" 
			или ЗначениеЗаполнено(ВидКомпании) = Ложь тогда
			
			ВозвращаемоеЗначение = ложь;
			элементы.НаименованиеКомпании.ЦветРамки = WebЦвета.Красный;
			элементы.ВидКомпании.ЦветРамки = WebЦвета.Красный;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ШагФормы = 2 Тогда
		Если ТЗПользователи.Количество() = 0 тогда
			
			ВозвращаемоеЗначение = ложь;
			элементы.КомандаДобавитьПользователя.ЦветРамки = WebЦвета.Красный;
			
		КонецЕсли;
	КонецЕсли;	
	                                  
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура КомандаНазад(Команда)
	ШагФормы = ШагФормы - 1;
	ПриИзмененииШагаФормы();
КонецПроцедуры     

&НаКлиенте
Процедура КомандаДобавитьПользователя(Команда)
		Если НЕ ПроверкаЕстьлиЗаполненныеПоляИРоли() тогда
			
			ВозвращаемоеЗначение = ложь;
			элементы.Логин.ЦветРамки = WebЦвета.Красный;
			элементы.Язык.ЦветРамки = WebЦвета.Красный;
			
			элементы.СЗРоли.ЦветРамки = WebЦвета.Красный;
			
		Иначе
			ИД = 0;
			
			Если ТЗПользователи.Количество() = 0 тогда
				ИД = 0;
			Иначе
				ТЗПользователи.Сортировать("ИД Убыв");
				ИД = ТЗПользователи[0].ИД;	
			КонецЕсли;	
			
			 тт = ТЗПользователи.Добавить();
			 тт.Логин = Логин;
			 тт.Пароль = Пароль;
			 тт.Язык = Язык;
			 тт.ФИО = ФИО;  
			 тт.ИД = ИД+1;   
			 
			 Для каждого Стр Из СЗРоли Цикл 
				 Если Стр.Пометка = Истина Тогда
					 тт = ТЗРоли.Добавить();  
					 тт.ИД = ИД+1;    
					 тт.роль = Стр.Значение;    
				 КонецЕсли;
			 КонецЦикла; 
			 
			 ВывестиПользователейНаФорму();
			 Логин = "";
			 Пароль = "";
			 Язык = "";   
			 ФИО = "";
			 ОчиститьУсловноеОформление();
			 Для каждого стр из СЗРоли Цикл
				 стр.Пометка = ложь;
			 КонецЦикла;

		КонецЕсли;	
		
КонецПроцедуры 
	
&НаСервере
Процедура ВывестиПользователейНаФорму() 
	
	
	УдаляемыеЭлементы = Новый Массив;
	Для каждого эл из Элементы цикл
		Если СтрНайти(эл.Имя, "пз_") <> 0 Тогда
			УдаляемыеЭлементы.Добавить(эл);
		КонецЕсли;
	КонецЦикла;
	Для каждого эл из УдаляемыеЭлементы цикл
		Элементы.Удалить(эл);
	КонецЦикла;

	УдаляемыеКоманды = Новый Массив;
	Для каждого эл из ЭтаФорма.Команды цикл
		Если СтрНайти(эл.Имя, "пз_") <> 0 Тогда
			УдаляемыеКоманды.Добавить(эл);
		КонецЕсли;
	КонецЦикла;
	Для каждого эл из УдаляемыеКоманды цикл
		ЭтаФорма.Команды.Удалить(эл);
	КонецЦикла;
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты(); 
	МассивУдаляемых = Новый Массив; 
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ИмяРеквизита = РеквизитФормы.Имя; 
		Если СтрНайти(ИмяРеквизита, "пз_") Тогда
			МассивУдаляемых.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты( , МассивУдаляемых);
	
	Для Каждого Стр Из ТЗПользователи Цикл      
		
		ГруппаКнопок11 = ЭтаФорма.Элементы.Добавить("пз_ГруппаТов"+Строка(Стр.ИД), Тип("ГруппаФормы"),Элементы.Группа10);
		ГруппаКнопок11.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКнопок11.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаКнопок11.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаКнопок11.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НоваяКомандаПлюс = ЭтаФорма.Команды.Добавить("пз_Команд"+Строка(стр.ИД));
		НоваяКомандаПлюс.Заголовок = "";  
		НоваяКомандаПлюс.Подсказка = Нстр("en = 'Remove'; es = 'Eliminar'; fr = 'Supprimer'; ru = 'Удалить'");
		НоваяКомандаПлюс.Действие = "УдалитьПользователяФормы"; 
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("пз_Кноп"+Строка(Стр.ИД), Тип("КнопкаФормы"),ГруппаКнопок11);
		НовыйЭлемент.Заголовок = "";  
		НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
		НовыйЭлемент.Картинка = БиблиотекаКартинок.УдалитьНепосредственно;
		НовыйЭлемент.ИмяКоманды = "пз_Команд"+Строка(стр.ИД);  
		
		ДобавляемыеРеквизиты = Новый Массив; 
		НовыйРеквизит = Новый РеквизитФормы("пз_Польз"+Строка(Стр.ИД),Новый ОписаниеТипов("Строка"));  
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);    
		
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("пз_ПФ"+Строка(Стр.ИД), Тип("ПолеФормы"),ГруппаКнопок11);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "пз_Польз"+Строка(Стр.ИД);
			новыйЭлемент.Доступность = Ложь;   
			НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , );
			
			ЭтотОбъект["пз_Польз"+Строка(Стр.ИД)]	=  СокрЛП(Стр.Логин);
		
	КонецЦикла;   
	
КонецПроцедуры   

&НаКлиенте
Процедура УдалитьПользователяФормы(Команда)
	
	ИД = Число(СтрЗаменить(Команда.Имя,"пз_Команд",""));
	
	СтруктураДляПоиска = Новый Структура("ИД", ИД); 
	МассивСтрок = ТЗПользователи.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивСтрок Цикл 
		ТЗПользователи.Удалить(Строка); 
	КонецЦикла;   
	
	МассивСтрок = ТЗРоли.НайтиСтроки(СтруктураДляПоиска); 
	Для каждого Строка Из МассивСтрок Цикл 
		ТЗРоли.Удалить(Строка); 
	КонецЦикла;  
	
	ВывестиПользователейНаФорму();
	
КонецПроцедуры    

&НаСервере
Процедура ОчиститьУсловноеОформление() 
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЕстьлиЗаполненныеПоляИРоли()

	ВозвращаемоеЗначение = Истина;
	
	Если СокрЛП(Логин) = "" Тогда 
		ВозвращаемоеЗначение = Ложь; 
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;    
	
	Если СокрЛП(Язык) = "" Тогда 
		ВозвращаемоеЗначение = Ложь;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;			
	
	
	Для каждого стр из СЗРоли Цикл
		ВозвращаемоеЗначение = стр.Пометка;
		Если  стр.Пометка = Истина тогда Прервать; КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции    


&НаКлиенте
Процедура КомандаСтарт(Команда)
	
	РезультатОрганизация = СоздатьОрганизациюПервогоЗапуска();
	
	СоздатьПользователейПервогоЗапуска(РезультатОрганизация);
	
КонецПроцедуры

&НаСервере
Функция СоздатьОрганизациюПервогоЗапуска()

	ВозвращаемоеЗначение = Справочники.Организации.ПустаяСсылка();
	
	Спр = Справочники.Организации.СоздатьЭлемент();
	Спр.Наименование = СокрЛП(НаименованиеКомпании);
	Спр.ВидКонтрагента = ВидКомпании;
	Спр.Префикс = СокрЛП(Префикс);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(Спр, "Логотип", Логотип);
	ОбщегоНазначения.ЗаписатьДанныеВХранилищеЗначения(Спр, "ФонПечатныхФорм", ФонПечатныхФорм);
	Спр.Записать();
	
	ВозвращаемоеЗначение = спр.Ссылка;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции    



&НаСервере
// Возвращает объект элемента справочника Пользователи, связанного с указанным
// пользователем информационной базы. Если связанного элемента нет, возвращает
// новый, ещё не записанный.
//
// Параметры:
//  ИдентификаторПользователяИБ - УникальныйИдентификатор - пользователь ИБ
//
// Возвращаемое значение:
//  СправочникОбъект.Пользователи
//
Функция ОбъектПользователяПоИдентификаторуИБ(ИдентификаторПользователяИБ)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ");
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	Возврат Справочники.Пользователи.СоздатьЭлемент();
КонецФункции

&НаСервере
Процедура СоздатьПользователейПервогоЗапуска(РезультатОрганизация)

	Для каждого стр из ТЗПользователи Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(стр.Логин));
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			Спр = Справочники.Пользователи.СоздатьЭлемент();
		Иначе
			Спр = ОбъектПользователяПоИдентификаторуИБ(ПользовательИБ.УникальныйИдентификатор);
		КонецЕсли;
		спр.Наименование = СокрЛП(стр.Логин);	
		спр.Внешний = Истина;	
		спр.ВходВПрограммуРазрешен = Истина;
		спр.ПолноеИмя = СокрЛП(стр.ФИО);
		спр.Организация = РезультатОрганизация; 
		
		
		
		
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.ЗапрещеноВосстанавливатьПароль = Истина;
		ПользовательИБ.ЗапрещеноИзменятьПароль = Истина;		
		ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Истина;
		ПользовательИБ.Имя = СокрЛП(стр.Логин);
			ПользовательИБ.Пароль = СокрЛП(стр.Пароль);
		ПользовательИБ.ПоказыватьВСпискеВыбора = Истина;
		ПользовательИБ.ПолноеИмя = СокрЛП(стр.ФИО);

		ПользовательИБ.Роли.Очистить();	
		Для Каждого Стр1 Из ТЗРоли Цикл   
			Если Стр.ИД = Стр1.ИД Тогда
				Роль = Метаданные.Роли.Найти(Стр1.Роль);
				Если Роль = Неопределено Тогда Продолжить КонецЕсли;
				Если Роль = Метаданные.Роли.Клиент Тогда 
					Продолжить;
				КонецЕсли;
				ПользовательИБ.Роли.Добавить(Роль); 
			КонецЕсли;
		КонецЦикла;
		ПользовательИБ.Язык = ?(ЗначениеЗаполнено(стр.Язык), Метаданные.Языки[стр.Язык], Метаданные.ОсновнойЯзык);
		ПользовательИБ.Записать();     
		
		спр.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;	
		спр.Роли = Справочники.Пользователи.СформироватьСписокРолей(ПользовательИБ);
		
		Спр.Записать();	
		
	КонецЦикла;
	
	
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени("tinycio-1c");
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			Спр = Справочники.Пользователи.СоздатьЭлемент();
		Иначе
			Спр = ОбъектПользователяПоИдентификаторуИБ(ПользовательИБ.УникальныйИдентификатор);
		КонецЕсли;
		спр.Наименование = "tinycio-1c";	
		спр.Внешний = Истина;	
		спр.ВходВПрограммуРазрешен = Истина;
		спр.ПолноеИмя = "tinycio-1c";
		спр.Организация = РезультатОрганизация; 
		
		
		
		
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.ЗапрещеноВосстанавливатьПароль = Истина;
		ПользовательИБ.ЗапрещеноИзменятьПароль = Истина;		
		ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Истина;
		ПользовательИБ.Имя = "tinycio-1c";
		ПользовательИБ.Пароль = "112233";
		ПользовательИБ.ПоказыватьВСпискеВыбора = ложь;
		ПользовательИБ.ПолноеИмя = "tinycio-1c";

		ПользовательИБ.Роли.Очистить();	
		Роль = Метаданные.Роли.Найти("Администратор");
		ПользовательИБ.Роли.Добавить(Роль);    
		
		ПользовательИБ.Язык = Метаданные.ОсновнойЯзык;
		ПользовательИБ.Записать();     
		
		спр.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;	
		спр.Роли = Справочники.Пользователи.СформироватьСписокРолей(ПользовательИБ);
		
		Спр.Записать();	



КонецПроцедуры
